[{"id":1,"name":"Dr Odile de Mesmay, GP","description":"Dr de Mesmay trained as a medical doctor in Paris, where she was born and raised. After qualifying as a GP from University Paris VI in 1996, she underwent further training in Robert Debré, the leading Parisian hospital for sick children.Upon her arrival in London in 1998 , Odile worked for two years with SOS Doctors Direct, a visiting medical company, developing her emergency skills. She has since worked in various private practices in London.","appointments":"South Kensington clinics.","SpecialInterests":"gynaecology.","img":"https://www.thesmartclinics.co.uk/wp-content/uploads/2020/11/Dr-Odile-de-Mesmay-GP.jpg"},{"id":2,"name":"Dr Michael Spira","description":"Dr Michael Spira is The Smart Clinics’ Medical Director and key member of our team of London based private GPs since the company inception. Dr Spira graduated from St Bartholomew’s Hospital, London, following his education at Stowe School, Buckingham. He worked for many years as Senior Partner in a large busy NHS general practice and was also Consulting Doctor to BUPA Wellness, London. He has a special interest in weight management which he has written many books about and made several national TV appearances.He has advised several leading slimming organisations and publications and is a member of the National Obesity Forum. He was a member of the Counterweight Project, the government-funded multi-centre obesity programme to evaluate the management of obesity in primary care and of the Scottish Intercollegiate Guidelines Network Working Party on Obesity.","appointments":"Harley Street clinic.","SpecialInterests":"weight management.","img":"https://alchetron.com/cdn/michael-spira-d483f3b5-3deb-4837-a8f9-d83d7ee5c6b-resize-750.jpg"},{"id":3,"name":"Dr Martin Dace","description":"GP Dr Martin Dace was trained at St Peter’s College, Oxford and Oxford University Medical School, gaining an intercalated BA in physiology in 1974 and BM, BCh in 1977. Prior to becoming a general practitioner he gained hospital experience in general medicine, geriatrics, surgery, paediatrics, obstetrics and gynaecology. He completed his general practice training in the practice of Professor Sir Brian Jarman in Paddington. Dr Dace was an NHS GP in South London from 1981 to 2002 (senior partner from 1990) and an independent GP from 2002 working in both the NHS and private sectors until joining Smart Clinics in 2016.","appointments":" Smart Clinics.","SpecialInterests":"humorous fiction under a pseudonym.","img":"https://www.thesmartclinics.co.uk/wp-content/uploads/2016/02/dr-martin-dace.jpg"},{"id":4,"name":"Dr Ilona Mercieca","description":"Dr. Mercieca qualified as a medical doctor in Malta, where she was born and raised. Following which she moved to UK to continue her specialisation in General Practice.She qualified as a GP in 2017 and is a member of the Royal College of General Practitioners..","appointments":" General Practitioners.","SpecialInterests":"women’s health.","img":"https://www.thesmartclinics.co.uk/wp-content/uploads/2021/05/Dr-Ilona-Mercieca.jpg"},{"id":5,"name":"Dr Hiren Patel","description":"Dr Patel splits his time between both NHS and Private GP work. He is interested in Healthcare Economics and has worked for several healthcare businesses including Reed Elsevier, Tribal Consulting and General Electric.","appointments":" General Practitioners.","SpecialInterests":"Psychiatry.","img":"https://images1-fabric.practo.com/hiren-f-patel-1488892116-58beb0d44383b.jpg"},{"id":6,"name":"Dr Mohamed Sheikh","description":"Mohamed completed his training at St. George’s University of London in 2013. Prior to embarking on Family and General Practice, he worked across several NHS hospital trusts and in the private sector. During this time, he gained hospital experience in acute medicine, general surgery, ear nose and throat (ENT) surgery, obstetrics and gynaecology, psychiatry, and care of the elderly.","appointments":"South Kensington.","SpecialInterests":"Lifestyle medicine.","img":"https://www.thesmartclinics.co.uk/wp-content/uploads/2021/06/Dr-Mohamed-Sheikh-300x300.jpg"}]